#
# Copyright (C) 2005 - 2020 TIBCO Software Inc. All rights reserved. Confidentiality & Proprietary.
# Licensed pursuant to commercial TIBCO End User License Agreement.
#

resource.com.jaspersoft.ji.report.options.metadata.ReportOptions.label=\u30EC\u30DD\u30FC\u30C8\u306E\u30D0\u30FC\u30B8\u30E7\u30F3

report.options.button.save.values=\u73FE\u5728\u306E\u5024\u3092\u4FDD\u5B58
report.options.saved.values.title=\u4FDD\u5B58\u3055\u308C\u305F\u5024\u306E\u9078\u629E

report.options.controls.dialog.button.save.values=&nbsp;\u5024\u306E\u4FDD\u5B58&nbsp;
report.options.controls.top.button.save.values=\u5024\u306E\u4FDD\u5B58

report.options.select.label=\u4FDD\u5B58\u3055\u308C\u305F\u5024\u3092\u4F7F\u7528:
report.options.select.empty.label=-- \u306A\u3057 --

report.options.option.saved=\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u4FDD\u5B58\u3055\u308C\u307E\u3057\u305F
report.options.option.removed=\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u524A\u9664\u3055\u308C\u307E\u3057\u305F
report.options.option.confirm.remove=#{option} \u3092\u524A\u9664\u3057\u3066\u3082\u3088\u308D\u3057\u3044\u3067\u3059\u304B\uFF1F

report.options.dialog.default.name=\u30AA\u30D7\u30B7\u30E7\u30F3

report.options.dialog.save.label.name=\u4FDD\u5B58\u3057\u305F\u5024\u306E\u540D\u524D\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044:
report.options.dialog.save.button.save=&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;OK&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
report.options.dialog.save.button.cancel=&nbsp;&nbsp;\u30AD\u30E3\u30F3\u30BB\u30EB&nbsp;&nbsp;

report.options.dialog.confirm.message=\u3053\u306E\u30EC\u30DD\u30FC\u30C8\u306B\u306F\u3001\u540C\u3058\u540D\u524D\u3067\u4FDD\u5B58\u3055\u308C\u305F\u5024\u304C\u65E2\u306B\u542B\u307E\u308C\u307E\u3059\u3002\u4E0A\u66F8\u304D\u3057\u307E\u3059\u304B?
report.options.dialog.confirm.save.label.approve=&nbsp;\u306F\u3044&nbsp;
report.options.dialog.confirm.save.label.disprove=&nbsp;&nbsp;\u3044\u3044\u3048&nbsp;&nbsp;

report.options.error.save.options.access.denied=\u30EC\u30DD\u30FC\u30C8\u306B\u3053\u306E\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4FDD\u5B58\u3059\u308B\u6A29\u9650\u304C\u3042\u308A\u307E\u305B\u3093\u3002\u6A29\u9650\u306E\u3042\u308B\u30E6\u30FC\u30B6\u30FC\u3068\u3057\u3066\u30ED\u30B0\u30A4\u30F3\u3057\u3066\u304F\u3060\u3055\u3044 (\u3042\u308B\u5834\u5408)\u3002
report.options.dialog.error.message.label.close=\u9589\u3058\u308B

report.options.repository.tooltip.expand.options.list=\u30EC\u30DD\u30FC\u30C8 \u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u4E00\u89A7\u3092\u8868\u793A\u3059\u308B
report.options.repository.tooltip.collapse.options.list=\u30EC\u30DD\u30FC\u30C8 \u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u4E00\u89A7\u3092\u975E\u8868\u793A\u306B\u3059\u308B

report.options.repository.type.label=\u30EC\u30DD\u30FC\u30C8 \u30AA\u30D7\u30B7\u30E7\u30F3

report.options.edit.title=\u30EC\u30DD\u30FC\u30C8 \u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u7DE8\u96C6
report.options.edit.header=\u30D1\u30E9\u30E1\u30FC\u30BF\u5024\u3092\u8A2D\u5B9A
report.options.edit.header.note=\u30EC\u30DD\u30FC\u30C8\u306E\u5B9F\u884C\u6642\u306B\u3001\u5165\u529B\u30B3\u30F3\u30C8\u30ED\u30FC\u30EB\u306B\u7528\u3044\u308B\u5024\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
report.options.edit.header.report=\u30EC\u30DD\u30FC\u30C8 \u30AA\u30D7\u30B7\u30E7\u30F3: 

report.options.edit.label.input.controls=\u5165\u529B\u30B3\u30F3\u30C8\u30ED\u30FC\u30EB
report.options.edit.label.id=ID
report.options.edit.label.label=\u540D\u524D
report.options.edit.label.description=\u8AAC\u660E

report.options.error.not.empty.name=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u540D\u524D\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
report.options.error.too.long.name=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u540D\u524D\u304C\u9577\u3059\u304E\u307E\u3059\u3002\u6700\u5927\u9577\u306F {0} \u6587\u5B57\u3067\u3059\u3002
report.options.error.invalid.chars.name=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u540D\u524D\u306B\u7121\u52B9\u306A\u6587\u5B57\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002\u5165\u529B\u30DF\u30B9\u306E\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002

report.options.error.not.empty.label=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30E9\u30D9\u30EB\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
report.options.error.too.long.label=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30E9\u30D9\u30EB\u304C\u9577\u3059\u304E\u307E\u3059\u3002\u6700\u5927\u9577\u306F {0} \u6587\u5B57\u3067\u3059\u3002
report.options.error.invalid.chars.label=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30E9\u30D9\u30EB\u306B\u7121\u52B9\u306A\u6587\u5B57\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002\u5165\u529B\u30DF\u30B9\u306E\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
report.options.error.already.exists.label=\u3053\u306E\u30E9\u30D9\u30EB\u306F\u3001\u30EC\u30DD\u30FC\u30C8\u3067\u3059\u3067\u306B\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u5225\u306E\u30E9\u30D9\u30EB\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002

report.options.error.too.long.description=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u8AAC\u660E\u304C\u9577\u3059\u304E\u307E\u3059\u3002\u6700\u5927\u9577\u306F {0} \u6587\u5B57\u3067\u3059\u3002

report.options.values.error.missing=\u3053\u3053\u3067\u5024\u306F\u5FC5\u9808\u3067\u3059\u3002

report.options.exception.no.report=\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u30EC\u30DD\u30FC\u30C8\u306B\u9069\u7528\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u30EC\u30DD\u30FC\u30C8\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
report.options.exception.local.report=\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u30ED\u30FC\u30AB\u30EB \u30EC\u30DD\u30FC\u30C8\u306B\u9069\u7528\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
report.options.exception.invalid.report=\u30EC\u30DD\u30FC\u30C8\u306E URI {0} \u306F\u7121\u52B9\u3067\u3059\u3002
report.options.exception.not.found=URI {0} \u306B\u30EC\u30DD\u30FC\u30C8 \u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
report.options.exception.wrong.resource=URI {0} \u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u3001\u30EC\u30DD\u30FC\u30C8 \u30AA\u30D7\u30B7\u30E7\u30F3 \u30EA\u30BD\u30FC\u30B9\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
report.options.exception.multiple.found=\u30EC\u30DD\u30FC\u30C8 {0} \u306B\u540D\u524D {1} \u306E\u30EC\u30DD\u30FC\u30C8\u304C {2,number,integer} \u3064\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u3002\u5225\u306E\u540D\u524D\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
report.options.exception.label.already.exists=\u30E9\u30D9\u30EB {1} \u306E\u30EC\u30DD\u30FC\u30C8 \u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u3059\u3067\u306B\u30D5\u30A9\u30EB\u30C0 {0} \u306B\u5B58\u5728\u3057\u3066\u3044\u307E\u3059\u3002\u5225\u306E\u30E9\u30D9\u30EB\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
report.options.exception.label.exists.another.report=\u540C\u3058\u540D\u524D\u3067\u4FDD\u5B58\u3055\u308C\u305F\u30AA\u30D7\u30B7\u30E7\u30F3\u304C\u3001\u30D5\u30A9\u30EB\u30C0\u5185\u306E\u5225\u306E\u30EC\u30DD\u30FC\u30C8\u306E\u4E0B\u306B\u65E2\u306B\u5B58\u5728\u3057\u307E\u3059\u3002\u5225\u306E\u540D\u524D\u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002

report.options.schedule.error.invalid=\u3053\u306E\u4FDD\u5B58\u3055\u308C\u305F\u30AA\u30D7\u30B7\u30E7\u30F3\u306F\u7121\u52B9\u3067\u3042\u308B\u305F\u3081\u3001\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u8A2D\u5B9A\u306B\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002\u4FDD\u5B58\u3055\u308C\u305F\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u7DE8\u96C6\u3059\u308B\u304B\u3001\u307E\u305F\u306F\u30B8\u30E7\u30D6\u306E\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3092\u30EC\u30DD\u30FC\u30C8\u304B\u3089\u76F4\u63A5\u8A2D\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002

report.options.edit.name.title=\u3053\u308C\u306F\u30EA\u30BD\u30FC\u30B9\u306E\u8868\u793A\u540D\u3067\u5909\u66F4\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
report.options.edit.id.title=\u3053\u308C\u306F\u30EA\u30BD\u30FC\u30B9\u306E\u6C38\u4E45 ID \u3067\u5909\u66F4\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
report.options.edit.description.title=\u8AAC\u660E