#
# Copyright (C) 2005 - 2020 TIBCO Software Inc. All rights reserved. Confidentiality & Proprietary.
# Licensed pursuant to commercial TIBCO End User License Agreement.
#

semanticLayerDataSource.name=Fonte de dados do dom\u00EDnio
semanticLayerDataSource.properties.definition=Defini\u00E7\u00E3o de esquema
semanticLayerDataSource.schema.required=Um valor \u00E9 necess\u00E1rio para a defini\u00E7\u00E3o do esquema.
semanticLayerDataSource.schema.exception=Uma exce\u00E7\u00E3o foi lan\u00E7ada ao criar um esquema da defini\u00E7\u00E3o: {0}. Consulte o log do servidor para o rastreamento total da pilha.
semanticLayerDataSource.schema.validationError={0}
# tree messages
sl.no.ds=Nenhum dom\u00EDnio encontrado
sl.no.ds.desc=Seu reposit\u00F3rio n\u00E3o inclui nenhum dom\u00EDnio. Entre em contato com seu administrador de sistema se deveria haver algum.
# exceptions
jsproexception.sl.datasource.has.an.invalid.type=Uma fonte de dados para este dom\u00EDnio tem um tipo inv\u00E1lido {0}. Ela n\u00E3o pode ser usada at\u00E9 que o tipo esteja definido corretamente.
jsproexception.sl.schema.has.an.invalid.type=Um arquivo de esquema para esse dom\u00EDnio tem um tipo inv\u00E1lido {0}. Ele n\u00E3o pode ser usado at\u00E9 que o tipo esteja definido corretamente.
jsproexception.sl.security.file.has.an.invalid.type=Um arquivo de seguran\u00E7a para este dom\u00EDnio tem um tipo inv\u00E1lido {0}. Ele n\u00E3o pode ser usado at\u00E9 que o tipo esteja definido corretamente.
jsproexception.sl.bundle.file.has.an.invalid.type=Um arquivo de pacote para este dom\u00EDnio tem um tipo inv\u00E1lido {0}. Ele n\u00E3o pode ser usado at\u00E9 que o tipo esteja definido corretamente.
domain.schema.element.name.unsupported.character=O nome do elemento cont\u00E9m um caractere n\u00E3o suportado. O nome n\u00E3o deve come\u00E7ar com um d\u00EDgito, conter um espa\u00E7o ou nenhum dos seguintes caracteres {0}
# Query Language
query.language.sl.label=Dom\u00EDnio
#
# WebServices
#
DATASOURCE_NOT_FOUND=N\u00E3o foi poss\u00EDvel encontrar o dom\u00EDnio {0} no reposit\u00F3rio.
DATASOURCE_IS_NOT_DOMAIN=Recurso {0} n\u00E3o \u00E9 um recurso de dom\u00EDnio. Revise as configura\u00E7\u00F5es do dom\u00EDnio.
CANNOT_EXTRACT_METADATA=O sistema n\u00E3o pode extrair metadados para dom\u00EDnio {0}. Verifique as configura\u00E7\u00F5es do dom\u00EDnio.
CANNOT_EXECUTE_DOMAIN_QUERY=O sistema n\u00E3o pode executar a consulta para dom\u00EDnio {0}. Verifique as configura\u00E7\u00F5es do dom\u00EDnio.
NO_FIELDS_DOMAIN_QUERY=A consulta de dom\u00EDnio n\u00E3o solicita nenhum dado. Corrija as defini\u00E7\u00F5es de consulta.
#
#
#
resource.com.jaspersoft.commons.semantic.DataDefinerUnit.label=T\u00F3pico do dom\u00EDnio
#
# Validation
#
INVALID_PRESENTATION_LAYER=O esquema de dom\u00EDnio tem defini\u00E7\u00F5es de um item ou conjunto inv\u00E1lido.
RESOURCE_MISSING_FOR_PO=Refer\u00EAncias {0} do item ou conjunto de dom\u00EDnio referenciam um recurso inv\u00E1lido [{1}].
ITEM_BEING_USED_BY_RESOURCE=O item de dom\u00EDnio {0} est\u00E1 sendo usado pelo recurso [{1}].
DOMAIN_DEPENDENCY_PREVENTS_ACTION=Voc\u00EA est\u00E1 tentando modificar campos usados nas seguintes exibi\u00E7\u00F5es ou relat\u00F3rios Ad Hoc. N\u00E3o \u00E9 poss\u00EDvel salvar o dom\u00EDnio em seu estado atual. Para resolver depend\u00EAncias, anote a informa\u00E7\u00E3o abaixo e remova os campos das exibi\u00E7\u00F5es e relat\u00F3rios em que eles ocorrem. 
DOMAIN_DEPENDENCY_DISASTER_WARNING=Voc\u00EA est\u00E1 tentando modificar campos usados nas seguintes exibi\u00E7\u00F5es ou relat\u00F3rios Ad Hoc.
DOMAIN_DEPENDENCY_NO_ACCES_TO_RESOURCE=Um ou mais recursos que voc\u00EA n\u00E3o tem permiss\u00E3o de acesso.
INVALID_RESOURCE_LAYER=O esquema de dom\u00EDnio tem um recurso inv\u00E1lido.
DATASOURCE_MISSING_FOR_RESOURCE=A fonte de dados {0} que referencia ID de recurso {1} \u00E9 inv\u00E1lida.
TABLE_MISSING_FOR_RESOURCE=Existe uma refer\u00EAncia inv\u00E1lida para tabela de banco de dados : fonte de dados [{0}], nome da tabela [{1}], id de recurso de refer\u00EAncia [{2}].
FIELD_MISSING_FOR_RESOURCE=Refer\u00EAncia inv\u00E1lida para campo de banco de dados : fonte de dados [{0}], nome da tabela [{1}], nome do campo [{2}], id de recurso de refer\u00EAncia [{3}]
MULTIPLE_DATA_ISLANDS_FOR_GROUP=Conjunto de itens {0} cont\u00E9m itens de tabelas n\u00E3o juntadas.
INVALID_SECURITY_FILE=O arquivo de seguran\u00E7a do dom\u00EDnio \u00E9 inv\u00E1lido.
OBJECT_MISSING_FOR_SECURITY=Seguran\u00E7a de dom\u00EDnio referencia um objeto inv\u00E1lido [{0}].
RESOURCE_OBJECT_MISSING_FOR_SECURITY=Seguran\u00E7a de dom\u00EDnio referencia um objeto de recursos inv\u00E1lido [{0}].
INVALID_DOMAIN_DATASOURCE=A fonte de dados de dom\u00EDnio {0} \u00E9 inv\u00E1lida.
RESOURCE_MISSING_FOR_RESOURCE=ID do recurso {0}, que referencia ID do recurso {1}, n\u00E3o pode ser encontrado.
INVALID_SCHEMA=O esquema de dom\u00EDnio \u00E9 inv\u00E1lido. Revise o esquema.
IMPROPER_JOIN_ORDER=O recurso {0} tem uma ordem incorreta de recursos unidos: Pseud\u00F4nimo {1} desconhecido na express\u00E3o de {2}.
PO_ID_NOT_UNIQUE=ID para conjunto ou item {0} n\u00E3o \u00E9 \u00FAnico. Escolha um ID diferente.
RES_ID_NOT_UNIQUE=ID para recurso {0} n\u00E3o \u00E9 \u00FAnico. Escolha um ID diferente.
MISSING_DB_SCHEMA=A fonte de dados {0} n\u00E3o tem esquema de banco de dados. Um esquema de banco de dados \u00E9 obrigat\u00F3rio.
INVALID_FILTER_MISSING_FIELD=Condi\u00E7\u00E3o do filtro {0} referencia um ou mais campos, ID {1}, que n\u00E3o podem ser encontrados.
INVALID_SECURITY_FILTER_MISSING_FIELD=A condi\u00E7\u00E3o do filtro de seguran\u00E7a {0} referencia campos n\u00E3o encontrados, ID {1}.
INVALID_FILTER=Recurso {0} tem um filtro inv\u00E1lido [{1}].
INVALID_SECURITY_FILTER=Recurso {0} tem um filtro de seguran\u00E7a inv\u00E1lido [{1}].
JOIN_TYPE_NOT_SUPPORTED=Varias tabelas s\u00E3o unidas usando o tipo de jun\u00E7\u00E3o [{1}]. No entanto, a fonte de dados [{0}] n\u00E3o suporta esse tipo de jun\u00E7\u00E3o.
INVALID_QUERY=A consulta n\u00E3o \u00E9 v\u00E1lida. Ela n\u00E3o pode estar em branco e deve come\u00E7ar com uma declara\u00E7\u00E3o SELECT.

# 
# Query governing/Ad Hoc Settings
#
QG_100_QUERY_LIMITS = Limites da consulta
QG_100_QUERY_LIMITS_EXPLAIN = Essas configura\u00E7\u00F5es limitam os recursos do sistema utilizados por consultas definidas para relat\u00F3rios Ad Hoc.
QG_100_DATA_POLICIES = Pol\u00EDticas de dados
QG_100_DATA_POLICIES_EXPLAIN = Essas configura\u00E7\u00F5es determinam se o Editor Ad Hoc reescreve as consultas em resposta a a\u00E7\u00F5es do usu\u00E1rio final (processamento de dados push-down no RDBMS subjacente), ou executa o processamento usando um cache de mem\u00F3ria dos resultados da consulta original (processamento de dados no JasperReports Server). As configura\u00E7\u00F5es afetam os relat\u00F3rios criados ou salvos depois de altera\u00E7\u00E3o de configura\u00E7\u00F5es. Elas n\u00E3o se aplicam retroativamente.
QG_101_MAX_AVAILABLE_VALUES = Limite da linha da lista de valores do filtro Ad Hoc
QG_101_MAX_AVAILABLE_VALUES_EXPLAIN = O n\u00FAmero m\u00E1ximo de valores exibidos no Editor de Condi\u00E7\u00E3o na p\u00E1gina Escolher Dados Ad Hoc
QG_102_MAX_ROWS = Limite de linhas do conjunto de dados Ad Hoc
QG_102_MAX_ROWS_EXPLAIN = O n\u00FAmero m\u00E1ximo de linhas de resultado de uma consulta de relat\u00F3rio ad hoc.
QG_103_MAX_SECS = Tempo limite de consulta Ad Hoc (em segundos)
QG_103_MAX_SECS_EXPLAIN = O tempo m\u00E1ximo para uma consulta de um relat\u00F3rio Ad Hoc come\u00E7ar a retornar dados.
QG_104_DOMAIN_STRATEGY_ENABLED = Otimizar consultas para relat\u00F3rios com base em dom\u00EDnios
QG_104_DOMAIN_STRATEGY_ENABLED_EXPLAIN = Quando marcado, o Editor Ad Hoc aplica agrupamento, classifica\u00E7\u00E3o e agrega\u00E7\u00E3o \u00E0s consultas com base em dom\u00EDnios quando poss\u00EDvel. Caso contr\u00E1rio, a consulta inalterada \u00E9 executada e as opera\u00E7\u00F5es ocorrem na mem\u00F3ria.
QG_105_SQL_STRATEGY_ENABLED = Otimizar consultas para relat\u00F3rios com base em JDBC
QG_105_SQL_STRATEGY_ENABLED_EXPLAIN = Quando marcado, o Editor Ad Hoc aplica agrupamento, classifica\u00E7\u00E3o e agrega\u00E7\u00E3o \u00E0s consultas que acessam fonte de dados JDBC quando poss\u00EDvel. Caso contr\u00E1rio, a consulta inalterada \u00E9 executada e as opera\u00E7\u00F5es ocorrem na mem\u00F3ria.
QG_106_GENERAL = Geral
QG_106_GENERAL_EXPLAIN = Configura\u00E7\u00F5es Ad Hoc Gerais
QG_107_VIEW_QUERY = Configurar consulta de visualiza\u00E7\u00E3o
QG_107_VIEW_QUERY_EXPLAIN = Ativar visualiza\u00E7\u00E3o da consulta no Editor Ad Hoc
QG_107_DISPLAY_NULL_AS_ZERO = Exibir Nulo como Zero
QG_107_DISPLAY_NULL_AS_ZERO_EXPLAIN = Exibir nulo como zero para valor agregado