#
# Copyright (C) 2005 - 2020 TIBCO Software Inc. All rights reserved. Confidentiality & Proprietary.
# Licensed pursuant to commercial TIBCO End User License Agreement.
#

semanticLayerDataSource.name=Source de donn\u00E9es du domaine
semanticLayerDataSource.properties.definition=D\u00E9finition du sch\u00E9ma
semanticLayerDataSource.schema.required=Une valeur est requise pour la d\u00E9finition du sch\u00E9ma.
semanticLayerDataSource.schema.exception=Une exception a \u00E9t\u00E9 lev\u00E9e lors de la cr\u00E9ation d\u2019un sch\u00E9ma \u00E0 partir de la d\u00E9finition\u00A0: {0}. Consulter le journal du serveur pour obtenir la trace de pile compl\u00E8te.
semanticLayerDataSource.schema.validationError={0}
# tree messages
sl.no.ds=Aucun domaine trouv\u00E9
sl.no.ds.desc=Votre r\u00E9f\u00E9rentiel ne comporte aucun domaine. Contactez l\u2019administrateur syst\u00E8me si cette situation est anormale.
# exceptions
jsproexception.sl.datasource.has.an.invalid.type=Le type {0} de source de donn\u00E9es est incorrect pour ce domaine. Vous devez d\u00E9finir un type valide pour utiliser la source.
jsproexception.sl.schema.has.an.invalid.type=Un type de fichier sch\u00E9ma est incorrect pour ce domaine {0}. Vous devez d\u00E9finir un type valide pour utiliser le fichier sch\u00E9ma.
jsproexception.sl.security.file.has.an.invalid.type=Un type de fichier s\u00E9curit\u00E9 est incorrect pour ce domaine {0}. Vous devez d\u00E9finir un type valide pour utiliser le fichier s\u00E9curit\u00E9.
jsproexception.sl.bundle.file.has.an.invalid.type=Le type {0} d''un fichier de groupe est incorrect pour ce domaine. Vous devez d\u00E9finir un type valide pour utiliser le fichier de groupe.
domain.schema.element.name.unsupported.character=Le nom de l\u2019\u00E9l\u00E9ment contient un caract\u00E8re non pris en charge. Il ne peut pas commencer par un chiffre, et de doit comprendre ni espace, ni les caract\u00E8res suivants : {0}
# Query Language
query.language.sl.label=Domaine
#
# WebServices
#
DATASOURCE_NOT_FOUND=Le domaine {0} est introuvable dans le r\u00E9f\u00E9rentiel.
DATASOURCE_IS_NOT_DOMAIN=La ressource {0} n\u2019est pas une ressource de domaine. V\u00E9rifier les param\u00E8tres du domaine.
CANNOT_EXTRACT_METADATA=Le syst\u00E8me ne peut pas extraire les m\u00E9tadonn\u00E9es du domaine {0}. V\u00E9rifier les param\u00E8tres du domaine.
CANNOT_EXECUTE_DOMAIN_QUERY=Le syst\u00E8me ne peut pas ex\u00E9cuter la requ\u00EAte pour le domaine {0}. V\u00E9rifier les param\u00E8tres du domaine.
NO_FIELDS_DOMAIN_QUERY=La requ\u00EAte du domaine ne n\u00E9cessite aucune donn\u00E9e. Corriger les param\u00E8tres de la requ\u00EAte.
#
#
#
resource.com.jaspersoft.commons.semantic.DataDefinerUnit.label=Rubrique du domaine
#
# Validation
#
INVALID_PRESENTATION_LAYER=Le sch\u00E9ma du domaine comporte des d\u00E9finitions d\u2019ensemble ou d\u2019\u00E9l\u00E9ment non valides.
RESOURCE_MISSING_FOR_PO=L\u2019ensemble ou l\u2019\u00E9l\u00E9ment de domaine {0} fait r\u00E9f\u00E9rence \u00E0 une ressource non valide [{1}].
ITEM_BEING_USED_BY_RESOURCE=L''\u00E9l\u00E9ment Domaine {0} est d\u00E9j\u00E0 utilis\u00E9 par la ressource [{1}].
DOMAIN_DEPENDENCY_PREVENTS_ACTION=Vous tentez de modifier des champs qui sont utilis\u00E9s dans les affichages ou rapports \u00E0 la demande suivants. Vous ne pouvez pas enregistrer le Domaine dans son \u00E9tat actuel. Pour r\u00E9soudre les d\u00E9pendances, lisez attentivement les informations ci-apr\u00E8s et supprimez les champs dans les affichages et rapports o\u00F9 ils figurent. 
DOMAIN_DEPENDENCY_DISASTER_WARNING=Vous tentez de modifier des champs qui sont utilis\u00E9s dans les affichages ou rapports \u00E0 la demande suivants.
DOMAIN_DEPENDENCY_NO_ACCES_TO_RESOURCE=Une ou plusieurs ressources pour lesquelles vous n'avez pas la permission d'acc\u00E8s.
INVALID_RESOURCE_LAYER=Le sch\u00E9ma du domaine contient une ressource non valide.
DATASOURCE_MISSING_FOR_RESOURCE=La source de donn\u00E9es {0} qui fait r\u00E9f\u00E9rence \u00E0 l\u2019ID de ressource {1} n\u2019est pas valide.
TABLE_MISSING_FOR_RESOURCE=R\u00E9f\u00E9rence \u00E0 la table de base de donn\u00E9es incorrecte\u00A0: source de donn\u00E9es [{0}], nom de table [{1}], en r\u00E9f\u00E9rence \u00E0 l\u2019ID de ressource [{2}].
FIELD_MISSING_FOR_RESOURCE=R\u00E9f\u00E9rence au champ de base de donn\u00E9es incorrecte\u00A0: source de donn\u00E9es [{0}], nom de table [{1}], nom de champ [{2}], en r\u00E9f\u00E9rence \u00E0 l\u2019ID de ressource [{3}]
MULTIPLE_DATA_ISLANDS_FOR_GROUP=L\u2019ensemble d\u2019\u00E9l\u00E9ments {0} contient des \u00E9l\u00E9ments de tables non jointes.
INVALID_SECURITY_FILE=Le fichier de s\u00E9curit\u00E9 du domaine n'est pas valide.
OBJECT_MISSING_FOR_SECURITY=La s\u00E9curit\u00E9 du domaine fait r\u00E9f\u00E9rence \u00E0 un objet non valide [{0}].
RESOURCE_OBJECT_MISSING_FOR_SECURITY=La s\u00E9curit\u00E9 du domaine fait r\u00E9f\u00E9rence \u00E0 un objet de ressource non valide [{0}].
INVALID_DOMAIN_DATASOURCE=La source de donn\u00E9es du domaine {0} n\u2019est pas valide.
RESOURCE_MISSING_FOR_RESOURCE=Impossible de trouver l\u2019ID de ressource {0} qui fait r\u00E9f\u00E9rences \u00E0 l\u2019ID de ressource {1}.
INVALID_SCHEMA=Le sch\u00E9ma du domaine n\u2019est pas valide. V\u00E9rifier le sch\u00E9ma.
IMPROPER_JOIN_ORDER=L\u2019ordre des ressources jointes de la ressource [{0}] est incorrect\u00A0: l\u2019alias {1} est inconnu dans l\u2019expression de {2}.
PO_ID_NOT_UNIQUE=L\u2019ID d\u00E9fini pour l\u2019ensemble ou l\u2019\u00E9l\u00E9ment {0} n\u2019est pas unique. Choisir un autre ID.
RES_ID_NOT_UNIQUE=L\u2019ID de la ressource {0} n\u2019est pas unique. Choisir un autre ID.
MISSING_DB_SCHEMA=La source de donn\u00E9es {0} ne comporte aucun sch\u00E9ma de base de donn\u00E9es. Un sch\u00E9ma de base de donn\u00E9es est requis.
INVALID_FILTER_MISSING_FIELD=La condition de filtre {0} fait r\u00E9f\u00E9rence \u00E0 un ou plusieurs champs ayant l\u2019ID {1} qui sont introuvables.
INVALID_SECURITY_FILTER_MISSING_FIELD=La condition de filtre de s\u00E9curit\u00E9 {0} fait r\u00E9f\u00E9rence \u00E0 des ID de champs {1} manquants.
INVALID_FILTER=La ressource {0} contient un filtre [{1}] non valide.
INVALID_SECURITY_FILTER=La ressource {0} contient un filtre de s\u00E9curit\u00E9 [{1}] non valide.
JOIN_TYPE_NOT_SUPPORTED=Plusieurs tables ont \u00E9t\u00E9 jointes avec le type de jointure [{1}]. La source de donn\u00E9es [{0}] ne prend pas en charge ce type de jointure.
INVALID_QUERY=La requ\u00EAte n\u2019est pas valide. Elle ne peut pas \u00EAtre vide et doit commencer par une instruction SELECT.

# 
# Query governing/Ad Hoc Settings
#
QG_100_QUERY_LIMITS = Nombre limite de requ\u00EAtes
QG_100_QUERY_LIMITS_EXPLAIN = Ces param\u00E8tres permettent de limiter les ressources syst\u00E8me utilis\u00E9es par les requ\u00EAtes d\u00E9finies pour les rapports \u00E0 la demande.
QG_100_DATA_POLICIES = Strat\u00E9gies des donn\u00E9es
QG_100_DATA_POLICIES_EXPLAIN = Ces param\u00E8tres permettent de d\u00E9terminer si l\u2019\u00E9diteur Ad Hoc r\u00E9\u00E9crit les requ\u00EAtes en r\u00E9ponse aux actions de l\u2019utilisateur (autrement dit, renvoyer le traitement des donn\u00E9es sur le RDBMS sous-jacent) ou s\u2019il r\u00E9alise le traitement en fonction du cache des r\u00E9sultats de la requ\u00EAte initiale (r\u00E9aliser le traitement des donn\u00E9es dans JasperReports Server). Les param\u00E8tres ont une incidence sur les rapports cr\u00E9\u00E9s ou enregistr\u00E9s apr\u00E8s la modification de ces param\u00E8tres. Ils ne s\u2019appliquent pas de mani\u00E8re r\u00E9troactive.
QG_101_MAX_AVAILABLE_VALUES = Limite du nombre de lignes de valeurs de la liste de filtres \u00E0 la demande
QG_101_MAX_AVAILABLE_VALUES_EXPLAIN = Le nombre maximal de valeurs affich\u00E9es dans l\u2019\u00E9diteur de conditions de la page Choisir les donn\u00E9es \u00E0 la demande
QG_102_MAX_ROWS = Limite du nombre de lignes des fichiers \u00E0 la demande
QG_102_MAX_ROWS_EXPLAIN = Le nombre maximal de lignes qu\u2019une requ\u00EAte de rapport \u00E0 la demande peut renvoyer.
QG_103_MAX_SECS = D\u00E9lai d\u2019expiration des requ\u00EAtes \u00E0 la demande (secondes)
QG_103_MAX_SECS_EXPLAIN = Le d\u00E9lai maximal avant qu\u2019une requ\u00EAte d\u2019un rapport \u00E0 la demande ne commence \u00E0 renvoyer des donn\u00E9es.
QG_104_DOMAIN_STRATEGY_ENABLED = Optimiser les requ\u00EAtes pour les rapports bas\u00E9s sur les domaines
QG_104_DOMAIN_STRATEGY_ENABLED_EXPLAIN = Lorsque cette option est s\u00E9lectionn\u00E9e, l\u2019\u00E9diteur Ad Hoc applique le regroupement, le tri et l\u2019agr\u00E9gation aux requ\u00EAtes en fonction des domaines, dans la mesure du possible. Dans les autres cas, la requ\u00EAte non modifi\u00E9e est ex\u00E9cut\u00E9e et les op\u00E9rations sont effectu\u00E9es en m\u00E9moire.
QG_105_SQL_STRATEGY_ENABLED = Optimiser les requ\u00EAtes pour les rapports bas\u00E9s sur JDBC
QG_105_SQL_STRATEGY_ENABLED_EXPLAIN = Lorsque cette option est s\u00E9lectionn\u00E9e, l\u2019\u00E9diteur Ad Hoc applique le regroupement, le tri et l\u2019agr\u00E9gation aux requ\u00EAtes acc\u00E9dant \u00E0 une source de donn\u00E9es JDBC, dans la mesure du possible. Dans les autres cas, la requ\u00EAte non modifi\u00E9e est ex\u00E9cut\u00E9e et les op\u00E9rations sont effectu\u00E9es en m\u00E9moire.
QG_106_GENERAL = G\u00E9n\u00E9ral
QG_106_GENERAL_EXPLAIN = Param\u00E8tres \u00E0 la demande g\u00E9n\u00E9raux
QG_107_VIEW_QUERY = Configurer la requ\u00EAte de visualisation
QG_107_VIEW_QUERY_EXPLAIN = Activer la requ\u00EAte de visualisation dans l'\u00E9diteur \u00E0 la demande
QG_107_DISPLAY_NULL_AS_ZERO = Afficher un z\u00E9ro pour la valeur nulle
QG_107_DISPLAY_NULL_AS_ZERO_EXPLAIN = Afficher un z\u00E9ro pour la valeur agr\u00E9g\u00E9e nulle