#
# Copyright (C) 2005 - 2020 TIBCO Software Inc. All rights reserved. Confidentiality & Proprietary.
# Licensed pursuant to commercial TIBCO End User License Agreement.
#

semanticLayerDataSource.name=\u30C9\u30E1\u30A4\u30F3 \u30C7\u30FC\u30BF \u30BD\u30FC\u30B9
semanticLayerDataSource.properties.definition=\u30B9\u30AD\u30FC\u30DE\u5B9A\u7FA9
semanticLayerDataSource.schema.required=\u30B9\u30AD\u30FC\u30DE\u5B9A\u7FA9\u306B\u306F\u5024\u304C\u5FC5\u8981\u3067\u3059\u3002
semanticLayerDataSource.schema.exception=\u5B9A\u7FA9\u304B\u3089\u30B9\u30AD\u30FC\u30DE\u3092\u4F5C\u6210\u4E2D\u306B\u4F8B\u5916\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3057\u305F: {0}\u3002\u30D5\u30EB\u30B9\u30BF\u30C3\u30AF \u30C8\u30EC\u30FC\u30B9\u306E\u30B5\u30FC\u30D0\u30FC \u30ED\u30B0\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
semanticLayerDataSource.schema.validationError={0}
# tree messages
sl.no.ds=\u30C9\u30E1\u30A4\u30F3\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
sl.no.ds.desc=\u30EA\u30DD\u30B8\u30C8\u30EA\u306B\u30C9\u30E1\u30A4\u30F3\u304C\u3042\u308A\u307E\u305B\u3093\u3002\u30B7\u30B9\u30C6\u30E0\u7BA1\u7406\u8005\u306B\u304A\u554F\u3044\u5408\u308F\u305B\u304F\u3060\u3055\u3044\u3002
# exceptions
jsproexception.sl.datasource.has.an.invalid.type=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306E\u30C7\u30FC\u30BF \u30BD\u30FC\u30B9\u306B\u7121\u52B9\u306A\u30BF\u30A4\u30D7 {0} \u304C\u3042\u308A\u307E\u3059\u3002\u30BF\u30A4\u30D7\u3092\u6B63\u3057\u304F\u8A2D\u5B9A\u3057\u306A\u3044\u3068\u3001\u4F7F\u7528\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
jsproexception.sl.schema.has.an.invalid.type=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306E\u30B9\u30AD\u30FC\u30DE \u30D5\u30A1\u30A4\u30EB\u306B\u7121\u52B9\u306A\u30BF\u30A4\u30D7 {0} \u304C\u3042\u308A\u307E\u3059\u3002\u30BF\u30A4\u30D7\u3092\u6B63\u3057\u304F\u8A2D\u5B9A\u3057\u306A\u3044\u3068\u3001\u4F7F\u7528\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
jsproexception.sl.security.file.has.an.invalid.type=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3 \u30D5\u30A1\u30A4\u30EB\u306B\u7121\u52B9\u306A\u30BF\u30A4\u30D7 {0} \u304C\u3042\u308A\u307E\u3059\u3002\u30BF\u30A4\u30D7\u3092\u6B63\u3057\u304F\u8A2D\u5B9A\u3057\u306A\u3044\u3068\u3001\u4F7F\u7528\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
jsproexception.sl.bundle.file.has.an.invalid.type=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306E\u30D0\u30F3\u30C9\u30EB \u30D5\u30A1\u30A4\u30EB\u306B\u7121\u52B9\u306A\u30BF\u30A4\u30D7 {0} \u304C\u3042\u308A\u307E\u3059\u3002\u30BF\u30A4\u30D7\u3092\u6B63\u3057\u304F\u8A2D\u5B9A\u3057\u306A\u3044\u3068\u3001\u4F7F\u7528\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
domain.schema.element.name.unsupported.character=\u30A8\u30EC\u30E1\u30F3\u30C8\u540D\u306B\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u6587\u5B57\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002\u540D\u524D\u306E\u5148\u982D\u306B\u6574\u6570\u306F\u4F7F\u7528\u3067\u304D\u307E\u305B\u3093\u3002\u307E\u305F\u3001\u30B9\u30DA\u30FC\u30B9\u3084\u6B21\u306E\u6587\u5B57\u3092\u4F7F\u7528\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093 {0}
# Query Language
query.language.sl.label=\u30C9\u30E1\u30A4\u30F3
#
# WebServices
#
DATASOURCE_NOT_FOUND=\u30EA\u30DD\u30B8\u30C8\u30EA\u306B\u30C9\u30E1\u30A4\u30F3 {0} \u304C\u3042\u308A\u307E\u305B\u3093\u3002
DATASOURCE_IS_NOT_DOMAIN=\u30EA\u30BD\u30FC\u30B9 {0} \u306F\u30C9\u30E1\u30A4\u30F3 \u30EA\u30BD\u30FC\u30B9\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u30C9\u30E1\u30A4\u30F3\u8A2D\u5B9A\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
CANNOT_EXTRACT_METADATA=\u30C9\u30E1\u30A4\u30F3 {0} \u306E\u30E1\u30BF\u30C7\u30FC\u30BF\u3092\u62BD\u51FA\u3067\u304D\u307E\u305B\u3093\u3002\u30C9\u30E1\u30A4\u30F3\u8A2D\u5B9A\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
CANNOT_EXECUTE_DOMAIN_QUERY=\u30C9\u30E1\u30A4\u30F3 {0} \u306E\u30AF\u30A8\u30EA\u3092\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3002\u30C9\u30E1\u30A4\u30F3\u8A2D\u5B9A\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
NO_FIELDS_DOMAIN_QUERY=\u30C9\u30E1\u30A4\u30F3 \u30AF\u30A8\u30EA\u306F\u4F55\u3082\u30C7\u30FC\u30BF\u3092\u8981\u6C42\u3057\u3066\u3044\u307E\u305B\u3093\u3002\u30AF\u30A8\u30EA\u8A2D\u5B9A\u3092\u4FEE\u6B63\u3057\u3066\u304F\u3060\u3055\u3044\u3002
#
#
#
resource.com.jaspersoft.commons.semantic.DataDefinerUnit.label=\u30C9\u30E1\u30A4\u30F3 \u30C8\u30D4\u30C3\u30AF
#
# Validation
#
INVALID_PRESENTATION_LAYER=\u30C9\u30E1\u30A4\u30F3 \u30B9\u30AD\u30FC\u30DE\u306B\u7121\u52B9\u306A\u96C6\u5408\u307E\u305F\u306F\u30A2\u30A4\u30C6\u30E0\u5B9A\u7FA9\u304C\u5B58\u5728\u3057\u3066\u3044\u307E\u3059\u3002
RESOURCE_MISSING_FOR_PO=\u30C9\u30E1\u30A4\u30F3 \u30BB\u30C3\u30C8\u307E\u305F\u306F\u30A2\u30A4\u30C6\u30E0 {0} \u304C\u7121\u52B9\u306A\u30EA\u30BD\u30FC\u30B9 [{1}] \u3092\u53C2\u7167\u3057\u3066\u3044\u307E\u3059\u3002
ITEM_BEING_USED_BY_RESOURCE=\u30C9\u30E1\u30A4\u30F3\u9805\u76EE {0} \u306F\u3001\u30EA\u30BD\u30FC\u30B9 [{1}] \u304C\u4F7F\u7528\u4E2D\u3067\u3059\u3002
DOMAIN_DEPENDENCY_PREVENTS_ACTION=\u6B21\u306E\u30A2\u30C9\u30DB\u30C3\u30AF \u30D3\u30E5\u30FC\u307E\u305F\u306F\u30EC\u30DD\u30FC\u30C8\u3067\u4F7F\u7528\u3055\u308C\u3066\u3044\u308B\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u5909\u66F4\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307E\u3059\u3002\u30C9\u30E1\u30A4\u30F3\u3092\u73FE\u5728\u306E\u72B6\u614B\u3067\u306F\u4FDD\u5B58\u3067\u304D\u307E\u305B\u3093\u3002\u4F9D\u5B58\u95A2\u4FC2\u3092\u89E3\u6C7A\u3059\u308B\u305F\u3081\u306B\u3001\u4EE5\u4E0B\u306E\u60C5\u5831\u3092\u8A18\u9332\u3057\u3066\u3001\u30D3\u30E5\u30FC\u3068\u30EC\u30DD\u30FC\u30C8\u304B\u3089\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u524A\u9664\u3057\u3066\u304F\u3060\u3055\u3044\u3002 
DOMAIN_DEPENDENCY_DISASTER_WARNING=\u6B21\u306E\u30A2\u30C9\u30DB\u30C3\u30AF \u30D3\u30E5\u30FC\u307E\u305F\u306F\u30EC\u30DD\u30FC\u30C8\u3067\u4F7F\u7528\u3055\u308C\u3066\u3044\u308B\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u5909\u66F4\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307E\u3059\u3002
DOMAIN_DEPENDENCY_NO_ACCES_TO_RESOURCE=\u30A2\u30AF\u30BB\u30B9\u6A29\u304C\u306A\u3044 1 \u3064\u307E\u305F\u306F\u8907\u6570\u306E\u30EA\u30BD\u30FC\u30B9\u3002
INVALID_RESOURCE_LAYER=\u30C9\u30E1\u30A4\u30F3 \u30B9\u30AD\u30FC\u30DE\u306B\u7121\u52B9\u306A\u30EA\u30BD\u30FC\u30B9\u304C\u5B58\u5728\u3057\u3066\u3044\u307E\u3059\u3002
DATASOURCE_MISSING_FOR_RESOURCE=\u30EA\u30BD\u30FC\u30B9 ID {1} \u3092\u53C2\u7167\u3057\u3066\u3044\u308B\u30C7\u30FC\u30BF \u30BD\u30FC\u30B9 {0} \u306F\u7121\u52B9\u3067\u3059\u3002
TABLE_MISSING_FOR_RESOURCE=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 \u30C6\u30FC\u30D6\u30EB\u3078\u306E\u7121\u52B9\u306A\u53C2\u7167\u304C\u3042\u308A\u307E\u3059:\u30C7\u30FC\u30BF \u30BD\u30FC\u30B9 [{0}]\u3001\u30C6\u30FC\u30D6\u30EB\u540D [{1}]\u3001\u53C2\u7167\u30EA\u30BD\u30FC\u30B9 ID [{2}]\u3002
FIELD_MISSING_FOR_RESOURCE=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 \u30D5\u30A3\u30FC\u30EB\u30C9\u3078\u306E\u7121\u52B9\u306A\u53C2\u7167:\u30C7\u30FC\u30BF \u30BD\u30FC\u30B9 [{0}]\u3001\u30C6\u30FC\u30D6\u30EB\u540D [{1}]\u3001\u30D5\u30A3\u30FC\u30EB\u30C9\u540D [{2}]\u3001\u53C2\u7167\u30EA\u30BD\u30FC\u30B9 ID [{3}]\u3002
MULTIPLE_DATA_ISLANDS_FOR_GROUP=\u30A2\u30A4\u30C6\u30E0 \u30BB\u30C3\u30C8 {0} \u306B\u3001\u975E\u7D50\u5408\u30C6\u30FC\u30D6\u30EB\u304B\u3089\u306E\u30A2\u30A4\u30C6\u30E0\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002
INVALID_SECURITY_FILE=\u30C9\u30E1\u30A4\u30F3 \u30BB\u30AD\u30E5\u30EA\u30C6\u30A3 \u30D5\u30A1\u30A4\u30EB\u304C\u7121\u52B9\u3067\u3059\u3002
OBJECT_MISSING_FOR_SECURITY=\u30C9\u30E1\u30A4\u30F3 \u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u304C\u7121\u52B9\u306A\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 [{0}] \u3092\u53C2\u7167\u3057\u3066\u3044\u307E\u3059\u3002
RESOURCE_OBJECT_MISSING_FOR_SECURITY=\u30C9\u30E1\u30A4\u30F3 \u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u304C\u7121\u52B9\u306A\u30EA\u30BD\u30FC\u30B9 \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8 [{0}] \u3092\u53C2\u7167\u3057\u3066\u3044\u307E\u3059\u3002
INVALID_DOMAIN_DATASOURCE=\u30C9\u30E1\u30A4\u30F3 \u30C7\u30FC\u30BF \u30BD\u30FC\u30B9 {0} \u306F\u7121\u52B9\u3067\u3059\u3002
RESOURCE_MISSING_FOR_RESOURCE=\u30EA\u30BD\u30FC\u30B9 ID {1} \u3092\u53C2\u7167\u3059\u308B\u30EA\u30BD\u30FC\u30B9 ID {0} \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
INVALID_SCHEMA=\u30C9\u30E1\u30A4\u30F3 \u30B9\u30AD\u30FC\u30DE\u304C\u7121\u52B9\u3067\u3059\u3002\u30B9\u30AD\u30FC\u30DE\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
IMPROPER_JOIN_ORDER=\u30EA\u30BD\u30FC\u30B9 {0} \u306B\u3001\u4E0D\u9069\u5207\u306A\u9806\u5E8F\u306E\u7D50\u5408\u30EA\u30BD\u30FC\u30B9\u304C\u5B58\u5728\u3057\u3066\u3044\u307E\u3059:{2} \u306E\u5F0F\u3067\u5225\u540D {1} \u306F\u4E0D\u660E\u3067\u3059\u3002
PO_ID_NOT_UNIQUE=\u30BB\u30C3\u30C8\u306E ID \u307E\u305F\u306F\u30A2\u30A4\u30C6\u30E0 {0} \u306F\u4E00\u610F\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u5225\u306E ID \u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
RES_ID_NOT_UNIQUE=\u30EA\u30BD\u30FC\u30B9 {0} \u306E ID \u304C\u4E00\u610F\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u5225\u306E ID \u3092\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
MISSING_DB_SCHEMA=\u30C7\u30FC\u30BF \u30BD\u30FC\u30B9 {0} \u306B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 \u30B9\u30AD\u30FC\u30DE\u304C\u3042\u308A\u307E\u305B\u3093\u3002\u3053\u308C\u306B\u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9 \u30B9\u30AD\u30FC\u30DE\u304C\u5FC5\u8981\u3067\u3059\u3002
INVALID_FILTER_MISSING_FIELD=\u30D5\u30A3\u30EB\u30BF\u6761\u4EF6 {0} \u304C\u30011 \u3064\u307E\u305F\u306F\u8907\u6570\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u3001ID {1}\u3001\u3092\u53C2\u7167\u3057\u3066\u3044\u307E\u3059\u304C\u3001\u3053\u308C\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
INVALID_SECURITY_FILTER_MISSING_FIELD=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30D5\u30A3\u30EB\u30BF\u6761\u4EF6 {0} \u304C\u3001\u5B58\u5728\u3057\u306A\u3044\u30D5\u30A3\u30FC\u30EB\u30C9\u3001ID {1} \u3092\u53C2\u7167\u3057\u3066\u3044\u307E\u3059\u3002
INVALID_FILTER=\u30EA\u30BD\u30FC\u30B9 {0} \u306B\u7121\u52B9\u306A\u30D5\u30A3\u30EB\u30BF [{1}] \u304C\u5B58\u5728\u3057\u3066\u3044\u307E\u3059\u3002
INVALID_SECURITY_FILTER=\u30EA\u30BD\u30FC\u30B9 {0} \u306B\u7121\u52B9\u306A\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3 \u30D5\u30A3\u30EB\u30BF [{1}] \u304C\u5B58\u5728\u3057\u3066\u3044\u307E\u3059\u3002
JOIN_TYPE_NOT_SUPPORTED=\u8907\u6570\u306E\u30C6\u30FC\u30D6\u30EB\u304C\u7D50\u5408\u30BF\u30A4\u30D7 [{1}] \u3092\u4F7F\u3063\u3066\u7D50\u5408\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u305F\u3060\u3057\u3001\u30C7\u30FC\u30BF \u30BD\u30FC\u30B9 [{0}] \u306F\u3001\u3053\u306E\u30BF\u30A4\u30D7\u306E\u7D50\u5408\u3092\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u307E\u305B\u3093\u3002
INVALID_QUERY=\u30AF\u30A8\u30EA\u304C\u6709\u52B9\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u7A7A\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002\u307E\u305F\u3001SELECT \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3067\u958B\u59CB\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002

# 
# Query governing/Ad Hoc Settings
#
QG_100_QUERY_LIMITS = \u30AF\u30A8\u30EA\u306E\u5236\u9650
QG_100_QUERY_LIMITS_EXPLAIN = \u3053\u308C\u3089\u306E\u8A2D\u5B9A\u306F\u3001\u30A2\u30C9\u30DB\u30C3\u30AF \u30EC\u30DD\u30FC\u30C8\u306B\u5B9A\u7FA9\u3055\u308C\u305F\u30AF\u30A8\u30EA\u304C\u4F7F\u7528\u3059\u308B\u30B7\u30B9\u30C6\u30E0 \u30EA\u30BD\u30FC\u30B9\u3092\u5236\u9650\u3057\u307E\u3059\u3002
QG_100_DATA_POLICIES = \u30C7\u30FC\u30BF \u30DD\u30EA\u30B7\u30FC
QG_100_DATA_POLICIES_EXPLAIN = \u3053\u308C\u3089\u306E\u8A2D\u5B9A\u306F\u3001\u30A8\u30F3\u30C9 \u30E6\u30FC\u30B6\u30FC\u306E\u64CD\u4F5C (RDBM \u5185\u306E\u30D7\u30C3\u30B7\u30E5\u30C0\u30A6\u30F3 \u30C7\u30FC\u30BF\u51E6\u7406) \u306B\u5BFE\u5FDC\u3057\u3066\u30A2\u30C9\u30DB\u30C3\u30AF \u30A8\u30C7\u30A3\u30BF\u304C\u30AF\u30A8\u30EA\u3092\u30EA\u30E9\u30A4\u30C8\u3059\u308B\u304B\u3001\u307E\u305F\u306F\u5143\u306E\u30AF\u30A8\u30EA \uFF08 JasperReports Server \u5185\u306E\u30C7\u30FC\u30BF\u51E6\u7406\uFF09 \u304B\u3089\u306E\u7D50\u679C\u306E\u30A4\u30F3\u30E1\u30E2\u30EA \u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u5BFE\u3057\u3066\u51E6\u7406\u3092\u5B9F\u884C\u3059\u308B\u306E\u304B\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002\u8A2D\u5B9A\u306E\u5909\u66F4\u5F8C\u306B\u4F5C\u6210\u307E\u305F\u306F\u4FDD\u5B58\u3055\u308C\u305F\u30EC\u30DD\u30FC\u30C8\u306B\u3001\u305D\u306E\u8A2D\u5B9A\u304C\u9069\u7528\u3055\u308C\u307E\u3059\u3002\u5909\u66F4\u524D\u306E\u30EC\u30DD\u30FC\u30C8\u306B\u9069\u7528\u3055\u308C\u308B\u3053\u3068\u306F\u3042\u308A\u307E\u305B\u3093\u3002
QG_101_MAX_AVAILABLE_VALUES = \u5024\u884C\u5236\u9650\u306E\u30A2\u30C9\u30DB\u30C3\u30AF \u30D5\u30A3\u30EB\u30BF \u30EA\u30B9\u30C8
QG_101_MAX_AVAILABLE_VALUES_EXPLAIN = [\u30A2\u30C9\u30DB\u30C3\u30AF \u30C7\u30FC\u30BF\u306E\u9078\u629E] \u30DA\u30FC\u30B8\u306E\u6761\u4EF6\u30A8\u30C7\u30A3\u30BF\u306B\u8868\u793A\u3059\u308B\u5024\u306E\u6700\u5927\u6570\u3067\u3059\u3002
QG_102_MAX_ROWS = \u30A2\u30C9\u30DB\u30C3\u30AF \u30C7\u30FC\u30BF\u30BB\u30C3\u30C8\u884C\u5236\u9650
QG_102_MAX_ROWS_EXPLAIN = \u30A2\u30C9\u30DB\u30C3\u30AF \u30EC\u30DD\u30FC\u30C8\u306E\u30AF\u30A8\u30EA\u304C\u8FD4\u3059\u3053\u3068\u304C\u3067\u304D\u308B\u6700\u5927\u884C\u6570\u3002
QG_103_MAX_SECS = \u30A2\u30C9\u30DB\u30C3\u30AF \u30AF\u30A8\u30EA \u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u79D2)
QG_103_MAX_SECS_EXPLAIN = \u30A2\u30C9\u30DB\u30C3\u30AF \u30EC\u30DD\u30FC\u30C8\u306E\u30AF\u30A8\u30EA\u304C\u30C7\u30FC\u30BF\u3092\u8FD4\u3057\u59CB\u3081\u308B\u307E\u3067\u306E\u6700\u5927\u6642\u9593\u3002
QG_104_DOMAIN_STRATEGY_ENABLED = \u30C9\u30E1\u30A4\u30F3 \u30D9\u30FC\u30B9\u306E\u30EC\u30DD\u30FC\u30C8\u306E\u30AF\u30A8\u30EA\u3092\u6700\u9069\u5316
QG_104_DOMAIN_STRATEGY_ENABLED_EXPLAIN = \u9078\u629E\u3057\u305F\u5834\u5408\u3001\u30A2\u30C9\u30DB\u30C3\u30AF \u30A8\u30C7\u30A3\u30BF\u306F\u3001\u53EF\u80FD\u306A\u5834\u5408\u306B\u30C9\u30E1\u30A4\u30F3\u306B\u57FA\u3065\u3044\u3066\u3001\u30B0\u30EB\u30FC\u30D7\u5316\u3001\u30BD\u30FC\u30C8\u3001\u304A\u3088\u3073\u96C6\u8A08\u3092\u30AF\u30A8\u30EA\u306B\u9069\u7528\u3057\u307E\u3059\u3002\u305D\u308C\u4EE5\u5916\u306E\u5834\u5408\u3001\u30AF\u30A8\u30EA\u306F\u5909\u66F4\u3055\u308C\u305A\u306B\u5B9F\u884C\u3055\u308C\u3001\u30A4\u30F3\u30E1\u30E2\u30EA\u3067\u64CD\u4F5C\u304C\u884C\u308F\u308C\u307E\u3059\u3002
QG_105_SQL_STRATEGY_ENABLED = JDBC \u30D9\u30FC\u30B9\u306E\u30EC\u30DD\u30FC\u30C8\u306E\u30AF\u30A8\u30EA\u3092\u6700\u9069\u5316
QG_105_SQL_STRATEGY_ENABLED_EXPLAIN = \u9078\u629E\u3057\u305F\u5834\u5408\u3001\u30A2\u30C9\u30DB\u30C3\u30AF \u30A8\u30C7\u30A3\u30BF\u306F\u3001\u53EF\u80FD\u306A\u5834\u5408\u306BJDBC \u30C7\u30FC\u30BF \u30BD\u30FC\u30B9\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u30AF\u30A8\u30EA\u306B\u30B0\u30EB\u30FC\u30D7\u5316\u3001\u30BD\u30FC\u30C8\u3001\u304A\u3088\u3073\u96C6\u8A08\u3092\u9069\u7528\u3057\u307E\u3059\u3002\u305D\u308C\u4EE5\u5916\u306E\u5834\u5408\u3001\u30AF\u30A8\u30EA\u306F\u5909\u66F4\u3055\u308C\u305A\u306B\u5B9F\u884C\u3055\u308C\u3001\u30A4\u30F3\u30E1\u30E2\u30EA\u3067\u64CD\u4F5C\u304C\u884C\u308F\u308C\u307E\u3059\u3002
QG_106_GENERAL = \u5168\u822C
QG_106_GENERAL_EXPLAIN = \u5168\u822C\u30A2\u30C9\u30DB\u30C3\u30AF\u8A2D\u5B9A
QG_107_VIEW_QUERY = \u8868\u793A\u30AF\u30A8\u30EA\u306E\u8A2D\u5B9A
QG_107_VIEW_QUERY_EXPLAIN = \u30A2\u30C9\u30DB\u30C3\u30AF \u30A8\u30C7\u30A3\u30BF\u3067\u8868\u793A\u30AF\u30A8\u30EA\u3092\u6709\u52B9\u306B\u3059\u308B
QG_107_DISPLAY_NULL_AS_ZERO = NULL \u3092 0 \u3068\u3057\u3066\u8868\u793A
QG_107_DISPLAY_NULL_AS_ZERO_EXPLAIN = \u96C6\u8A08\u5024\u3067 NULL \u3092 0 \u3068\u3057\u3066\u8868\u793A